---
kind: property
id: P:Autodesk.Revit.DB.BarTypeDiameterOptions.StandardHookBendDiameter
source: html/7e7db6ad-4ee1-613f-c730-a8921a78b0bf.htm
---
# Autodesk.Revit.DB.BarTypeDiameterOptions.StandardHookBendDiameter Property

Represents the standard hook bend diameter of the RebarBarType.

## Syntax (C#)
```csharp
public double StandardHookBendDiameter { get; set; }
```